Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་སྔོན་མ་བྱུང་བའི་ཕྱིར་སྔོན་མ་བྱུང་བའི་ཆོས་བསྟན་པའི་ལྟས་སུ་འཁོར་འདུས་པ་ཡང་མདོར་བསྟན་དགོས་སོ།
en: You should know that this teaching of the perfection of wisdom is unprecedented, so there has to be a brief teaching about the retinue assembling, as a prior indicator that there is going to be an unprecedented teaching of the Dharma.

source: །འོད་ཟེར་འབྱིན་ཅིང་འོད་བཀོད་པ་ཡང་སྟོན་ཞེས་འབྱུང་བས་ན་ཆོས་བཤད་པའི་ལྟས་བསྟན་པའི་ཕྱིར་འོད་བསྟན་པ་མཛད་པར་རིག་པར་བྱའོ།
en: Also, the show of light where he demonstrates emitting light rays and arraying light is done as a prior indicator that there is going to be an explanation of the Dharma.

source: །ཅིའི་ཕྱིར་ལྷའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་མི་འདེབས་པར་གནས་བརྟན་རབ་འབྱོར་ལ་གསོལ་བ་འདེབས་ཤེ་ན།
en: Why does the chief of the gods not address his questions to the Tathāgata? Why does he ask the elder Subhūti?

source: དེའི་ཚེ་འཁོར་རྣམས་ཉན་ཐོས་ཀྱིས་བཤད་པར་འདུལ་བའི་ཕྱིར་དེ་ལྟར་དེ་ལ་གསོལ་བ་བཏབ་པའི་སྒོ་ནས་དེ་བཞིན་གཤེགས་པ་ལ་ཡང་གསོལ་བ་བཏབ་པར་འགྱུར་རོ།
en: At that time, those in the retinue are to be trained by an explanation by a śrāvaka, so, by way of asking him, they also have asked the Tathāgata. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་བྱ།
en: How should bodhisattva great beings stand in the perfection of wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གང་ཡིན།
en: What is the bodhisattva great beings’ perfection of wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ནི་ཇི་ལྟར་བསླབ་པར་བྱ་ཞེས་དྲིས་པ་འདི་གསུམ་གྱི་ལན་ནི་འོག་ནས་སྟོན་ཏོ།
en: And how should bodhisattva great beings train in the perfection of wisdom?” The answers to these three questions are explained below. What is the bodhisattva great beings’ perfection of wisdom?

source: །དེ་ལ་སྔར་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནས་བརྩམས་ཏེ། རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཟུང་ནས་འབྲིང་དུ་བཤད་པ་བསྟན་ཏོ།
en: There, previously, taking the knowledge of all aspects as the point of departure, it gave a middle-length explanation based on the nonconceptual perfection of wisdom.

source: །འདིར་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནས་བརྩམས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲུབ་པ་རྣམ་པར་རྟོག་པ་དང་བཅས་པ་དང་རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་ཏོ།
en: Here, taking the knowledge of path aspects as the point of departure, it teaches the conceptual and nonconceptual perfection of wisdom that is the practice of bodhisattvas. “

source: །གང་དག་སྐྱོན་མེད་པ་ལ་ཞུགས་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་མཐུ་མེད་དེ་ཞེས་བྱ་བ་ནི་གང་དག་ལོག་པ་ཉིད་དུ་ངེས་པ་དེ་དག་ནི་རེ་ཞིག་སྐལ་བ་མེད་པ་ཞེས་བྱའོ།
en: Those who have entered into flawlessness are incapable of producing the thought of unsurpassed, perfect, complete awakening.” Take this as saying that those fixed in a state of error are, for the time being, without good fortune. “

source: །འོན་ཀྱང་གལ་ཏེ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་དག་ལ་ཡང་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་བྱ་བ་ནི་བཤད་པ་འདི་དེ་དག་གི་རྣ་བར་ཐོས་ན་ཡང་དོན་མེད་པར་མི་འགྱུར་བས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་གྲངས་མེད་པའི་ཕ་རོལ་དུ། དེ་དག་སངས་རྒྱས་ཉིད་ལ་འཇུག་པར་འགྱུར་རོ་ཞེས་ལུང་ལས་འབྱུང་བའི་ཕྱིར་རོ།
en: And yet if they also produce the thought of unsurpassed, perfect, complete awakening I still rejoice in them also.” If they hear this explanation it will not be in vain, because a scripture says, “On the other side of infinite, countless thousands of hundreds of one hundred million billion eons they will enter into buddhahood.” “

source: །ཀཽ་ཤི་ཀ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དྲིས་པ་རྣམ་པ་གསུམ་ལས་བར་མ་བསྟན་པ་ཡིན་ཡང་དང་པོར་བསྟན་པ་ནི་དེ་ལྟར་བསྟན་ན་གོ་སླ་བའི་ཕྱིར་རོ།
en: Kauśika, what is the bodhisattva great beings’ perfection of wisdom?” and so on. This is the middle of the three questions but is being taught here first because if it is taught thus, it is easier to understand.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་ལམ་གྱི་རྣམ་པ་ཤེས་པའི་ཕྱོགས་ཡིན་མོད་ཀྱི་གཉི་ག་ཡང་འདིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འདོད་པ་ལ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་བསྟན་པར་བྱའོ། །དེ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་ནི། ཀཽ་ཤི་ཀ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་གཟུགས་མི་རྟག་པར་ཡིད་ལ་བྱའོ། །དེ་བཞིན་དུ་སྡུག་བསྔལ་བ་དང་།
en: Even though it is true that this perfection of wisdom is the all-knowledge side for the śrāvaka and pratyekabuddha levels and the knowledge of path aspects side for the bodhisattva levels, here in this knowledge of path aspects that has to be taught to a bodhisattva who wants to attain the knowledge of all aspects there are both.

source: བདག་མེད་པ་དང་། སྟོང་པ་དང་། ནད་དང་། འབྲས་དང་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡིད་ལ་བྱེད་པ་བཅོ་ལྔ་བསྟན་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འགོག་པ་ལ་དམིགས་པའི་ཡིད་ལ་བྱེད་པ་བདུན་བསྟན་པས་བཤད་པར་རིག་པར་བྱའོ།
en: There, in regard to the all-knowledge side, you should know that “Kauśika, here bodhisattva great beings with a thought of awakening connected with the knowledge of all aspects should pay attention to form as impermanent, and they should pay attention to it as suffering, selfless, empty, a disease, a boil,” and so on, is an explanation teaching the fifteen attentions, and is teaching the seven attentions focused on the cessation of dependent origination.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་ནས་མ་འདྲེས་པའི་མཐའི་བར་དུ་མི་དམིགས་པར་ཡིད་ལ་བྱེད་པ་རྣམས་དང་། ཆོས་དང་ཆོས་རྣམས་སྦྱོར་བ་ཞེས་བྱ་བ་ལ་སོགས་པས་བསྟན་ཏོ།
en: In regard to the knowledge of path aspects side, it teaches that, with the nonapprehending attentions to the “perfections,” up to “the distinct attributes,” and with “putting one part of the picture together with the other parts,” and so on.

source: །དེ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སའི་ཚུལ་གྱིས་མི་རྟག་པ་ལ་སོགས་པའི་ཚིག་རྣམས་ཀྱི་དོན་བཤད་པར་བྱ་སྟེ།
en: Among these, I will explain the words “impermanent” and so on, in the way they are on the śrāvaka and pratyekabuddha levels.

source: མ་བྱུང་བ་ལས་འབྱུང་བ་དང་བྱུང་ནས་ཀྱང་མེད་པར་འགྱུར་བའི་ཕྱིར། མི་རྟག་པར་ཡིད་ལ་བྱེད་དོ།
en: They pay attention to [“form” and so on] as “impermanent” because what has not come into being comes into being, and what has come into being becomes nonexistent.

source: །བདག་ཉིད་སྡུག་བསྔལ་གསུམ་དང་ལྡན་པ་དང་། གཞན་དག་གི་སྡུག་བསྔལ་གྱི་རྒྱུར་འགྱུར་བའི་ཕྱིར། སྡུག་བསྔལ་བའོ།
en: They are “suffering” because they have as their nature the three sufferings and because they become a cause for the suffering of others.

source: །དབང་སྒྱུར་བ་མེད་པ་ལ་སོགས་པས་བདག་རང་ལ་བདག་གི་མཚན་ཉིད་དང་མི་ལྡན་པའི་ཕྱིར་བདག་མེད་པའོ།
en: They are “selfless” because, since they are without any agency and so on, they do not have their own defining mark.

source: །ཆུ་ཤིང་གི་སྡོང་བོ་ལྟར་ནང་གི་སྙིང་པོ་མེད་པས་ནང་བདག་གིས་སྟོང་པའི་ཕྱིར་སྟོང་པའོ།
en: They are “empty” like the trunk of a plantain tree because they are hollow inside, and hence empty of an inner self.

source: །རྐྱེན་དུ་མས་གསོ་དགོས་པ་དང་། ལུས་དང་ཡིད་ཀྱི་སྡུག་བསྔལ་གྱི་རྩ་བ་ཡིན་པའི་ཕྱིར་ནད་དང་འདྲ་བས་ནད་དོ། །ཞེན་པའི་གནོད་པ་དང་ལྡན་པ་དང་།
en: They are a “disease” because like a disease they require many conditions for a cure and are the root of physical and mental suffering.

source: ཉོན་མོངས་པའི་མི་གཙང་བ་ཟག་པ་དང་། སྐྱེ་བ་དང་། རྒ་བ་དང་། འཇིག་པས་རིམ་བཞིན་དུ་སྐྲངས་པ་དང་སྨིན་པ་དང་། རྡོལ་བའི་ཕྱིར་འབྲས་དང་འདྲ་བས་ན་འབྲས་སོ།
en: They are a “boil” because like a boil they oppress with obsession, drip with the pus of the afflictions, and gradually swell up, ripen, and burst with birth, old age, and death.

source: །ཕྱི་ནང་གི་གནོད་པས་ཟུག་པར་བྱེད་ཅིང་བཅོས་དཀའ་བས་ཟུག་རྔུ་དང་འདྲ་བའི་ཕྱིར་ཟུག་རྔུའོ།
en: They are a “thorn” because like a thorn they pierce with inner and outer trouble and are hard to treat.

source: །སྨད་པར་བྱ་བ་ཡིན་པ་དང་། གནོད་པར་འགྱུར་བའི་ཕྱིར་སྡིག་ཏོ་དང་འདྲ་བས་ན་སྡིག་པའོ།
en: They are a “misfortune” because like the wicked they are to be criticized and they become oppressive.

source: །རྐྱེན་གྱི་ཁར་ལས་པ་དང་། ལས་བདག་གིར་བྱ་བ་ཡིན་པས། གཞན་ལས་དབང་བསྒྱུར་བ་མེད་པའི་ཕྱིར་གཞན་ལ་རག་ལས་པའོ།
en: They are “dependent” because they labor in the face of conditions and they labor in the work of ‘making it mine,’ so they have no agency except from others.

source: །ནད་དང་རྒ་བ་དང་། འཆི་བ་རྣམས་ཀྱིས་རབ་ཏུ་འཇིག་པའི་རང་བཞིན་ཡིན་པའི་ཕྱིར། འཇིག་པའི་ཆོས་ཅན་ནོ།
en: They are “headed to destruction” because “by their nature” they are thoroughly destroyed by sickness, old age, and death.

source: །འདུས་བྱས་ཀྱི་མཚན་ཉིད་གསུམ་དང་ལྡན་ཞིང་འཇིག་རྟེན་གྱི་ཆོས་མི་བརྟན་པ་བརྒྱད་དང་ལྡན་པའི་ཕྱིར་མི་བརྟན་པའོ། །རང་གི་ངང་དང་།
en: They are “shaky” because they have the three marks of a compounded phenomenon and have the eight fickle worldly dharmas.

source: གནོད་པས་ཀྱང་འཇིག་པར་འགྱུར་བའི་ངང་ཚུལ་ཅན་ཡིན་པའི་ཕྱིར། རབ་ཏུ་འཇིག་པའོ།
en: They are “brittle” because it is in their inner nature to be destroyed and because they are destroyed by something harming them.

source: །མི་འཇིགས་པ་ཞེས་བྱ་བ་ཉེ་བར་ཞི་བ་བདེ་བའི་གཉེན་པོ་ཡིན་པ་དང་། འཇིགས་པ་ཐམས་ཅད་ཀྱི་རྒྱུ་ཡིན་པའི་ཕྱིར་འཇིགས་པའོ།
en: They are “a hazard” because “the absence of hazards” is peace, is pleasure, and is the antidote, and they are the cause of all fears.

source: །མ་ཚོར་བཞིན་དུ་གནོད་པ་སྣ་ཚོགས་ཀྱིས་འཚེ་བའི་ཕྱིར། འཚེ་བའོ།
en: They are “persecution” because even when they are not felt, they persecute in various harmful ways.

source: །གནོད་པ་རྣམ་པ་མང་པོ་དང་། འདྲེ་བ་དང་། འགོ་བའི་ནད་དང་འདྲ་བའི་ཕྱིར། འགོ་བའི་ནད་དོ། །བདག་མེད་པ་དང་། ཞི་བར་ཡིད་ལ་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལ། །ངག་གི་མཚན་ཉིད་དང་བྲལ་བའི་ཕྱིར་བདག་མེད་པའོ།
en: They are “a headache” because they hurt in many ways like a nagging demon and a headache.

source: །སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བའི་ཕྱིར་ཞི་བའོ། །ཉོན་མོངས་པ་དང་མི་ལྡན་པའི་ཕྱིར་དབེན་པའོ། །བདག་དང་བདག་གི་བས་སྟོང་པ་ཉིད་དང་ལྡན་པའི་ཕྱིར་སྟོང་པ་ཉིད་དོ། །འདུས་བྱས་ཀྱི་མཚན་མ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་མཚན་མ་མེད་པའོ། །ཁམས་གསུམ་དུ་མི་སྨོན་པས་སྨོན་པ་མེད་པའོ། །ཕྱིས་ལས་མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་ཕྱིར།
en: As for “they should pay attention to cessations as selfless, calm,” and so on, construe them as “selfless” because they are devoid of the mark of a self; “calm” because all suffering is calmed; “isolated” because they are without afflictions; “emptiness” because they are endowed with the emptiness of a self and what belongs to a self; “signlessness” because they are without all the causal signs of compounded phenomena; “wishlessness” because they do not wish for anything in the three realms; and a “nonenactment” because karma does not bring anything about later. “

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ཞེས་བྱ་བར་སྦྱར་རོ། །ཆོས་དང་ཆོས་རྣམས་སྦྱོར་བ་བྱེད་ཅེས་བྱ་བ་ལ་སོགས་པ་ལ། བྱང་ཆུབ་ཀྱི་སེམས་དང་། དགེ་བའི་རྩ་བའི་སེམས་དང་། ཡོངས་སུ་བསྔོ་བའི་སེམས་རྣམས་ཕན་ཚུན་དུ་འགྲོགས་པར་ཡིད་ལ་བྱེད་པ་ནི་སྦྱོར་བའོ།
en: Putting one part of the picture together with the other parts,” and so on—“putting together” is paying attention to the thought of awakening, the thought of the wholesome root, and the thought of dedication touching each other.

source: །གསུམ་ཆར་ཡང་བདག་གི་ངོ་བོ་དང་། གཞན་གྱི་ངོ་བོ་ལ་ཡོད་པ་མ་ཡིན་པར་ཡིད་ལ་བྱེད་པ་ནི་དཔྱོད་པར་བྱེད་པའོ།
en: They “analyze” when they pay attention to all three not having the other’s intrinsic nature as its own intrinsic nature.

source: །གསུམ་ཆར་ཡང་སེམས་མ་ཡིན་པའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་པའོ། །བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་སེམས་མ་ཡིན་པའོ་ཞེས་ཡིད་ལ་བྱེད་པ་བཤད་ཟིན་པའི་དོན་ཡོངས་སུ་རྫོགས་པའོ།
en: They “complete” when they pay attention to the meaning that has already been explained that all three are “inconceivable because they are not thought, not thought because they are inconceivable.” “

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་ཡང་སོ་སོར་རྟོག་ལ་ཆོས་གང་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་དུ་རྒྱས་པ་སྟེ།
en: This not settling down on… any one part, even while thus making an examination of all the parts of the picture” is the “extending” completely.

source: འདི་ནི་བདག་མེད་པར་སོ་སོར་བརྟགས་པ་བཞི་པའོ།
en: This is the fourth detailed and thorough analysis of all the dharmas as selfless. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་བའི་རྩ་བའི་སེམས་གང་ཡིན་པ་དེ་བྱང་ཆུབ་ཀྱི་སེམས་དང་འགྲོགས་པ་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་ཅི་བསྟན་ཞེ་ན།
en: The bodhisattva great beings’ thought of the wholesome roots is not touched by the thought of awakening.” What does this teach?

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྔར་ཀུན་རྫོབ་ཀྱི་ཡིད་ལ་བྱེད་པས་དགེ་བའི་རྩ་བ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ་ཞེས་སྤྱིར་ཡོངས་སུ་བསྔོ་བར་བྱས་ནས། དོན་དམ་པའི་ཚུལ་དུ་སོ་སོར་བརྟགས་ནས་དགེ་བའི་རྩ་བའི་སེམས་དང་། བྱང་ཆུབ་ཀྱི་སེམས་དང་ཡོངས་སུ་བསྔོ་བའི་སེམས་རྣམས་ཕན་ཚུན་དུ་འགྲོགས་པ་མེད་དེ། དེ་ལྟར་འགྲོགས་པ་མེད་པས་ཡོངས་སུ་བསྔོ་བ་ཡོད་དམ་མེད་ཅེས་སོ་སོར་རྟོག་གོ།
en: Earlier bodhisattvas, having made a dedication in general with conventional attention—”I dedicate these wholesome roots to unsurpassed, perfect, complete awakening”—after having made an examination in the ultimate mode, since the thought of the wholesome root, the thought of awakening, and the thought of dedication do not touch each other, they examine whether, since they do not touch, dedication exists or not.

source: །འདིར་དགའ་ཞིག་གལ་ཏེ་སེམས་རྣམ་པར་འགྲོགས་པ་མེད་ཀྱང་འོན་ཀྱང་སེམས་སྔ་མའི་དབང་གིས་བསྐྱེད་པའི་འདུ་བྱེད་ཀྱི་བྱེ་བྲག་ནི་སེམས་ཕྱི་མ་དང་ལྷན་ཅིག་ཏུ་འགྲོགས་པར་འགྱུར་ཏེ། ཐམས་ཅད་ཀྱི་ཐ་མའི་སེམས་ལ་ནི་འདུ་བྱེད་ཐམས་ཅད་རྫོགས་པར་འགྱུར་རོ།
en: Here some say the thoughts have not touched, but still a specific volitional factor produced through the force of an earlier thought, simultaneous with the later thought, does touch, so all the volitional factors become complete in the final thought of all.

source: །དེ་བས་ན་སྒོ་འདིས་སེམས་རྣམ་པར་འགྲོགས་པ་ཡོད་དོ་ཞེས་ཟེར་ཏེ།
en: In this way, therefore, thoughts have touched.

source: དེ་བས་ན་དེ་བསྩལ་བའི་ཕྱིར། དགེ་བའི་རྩ་བའི་སེམས་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མེད་ཅེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: To eliminate that, it says “the thought of the wholesome roots does not exist… in the thought of awakening,” and so on.

source: བག་ཆགས་ཀྱི་འདུ་བྱེད་ལ་སོགས་པའི་སྒོ་ནས་སེམས་དེ་ལ་སེམས་གཞན་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ།
en: It means that thought is not in the other thought, by way of a volitional factor left as a residual impression and so on.

source: འདི་ལྟར་སེམས་ཉིད་མེད་པར་བསྟན་པས་བག་ཆགས་ཀྱི་འདུ་བྱེད་ལ་སོགས་པ་ནི་རི་བོང་གི་རྭ་རྣོ་བ་དང་རྟུལ་བའི་དངོས་པོ་ལྟ་བུར་མི་སྣང་ངོ་ཞེས་བྱ་བའི་ཕྱིར་དེ་སྐད་དུ་བཤད་དོ།
en: It says this because having thus taught that the actual thought does not exist, there is no volitional factor left as a residual impression and so on, like an entity that is the sharpness or dullness of a rabbit’s horn.

source: །དེ་ལྟར་གཞན་གྱི་ངོ་བོ་ལ་མེད་པར་དཔྱད་ནས་ཡང་བདག་གི་ངོ་བོ་ལ་དཔྱོད་དོ། །དགེ་བའི་རྩ་བའི་སེམས་གང་ཡིན་པ་དེ་དགེ་བའི་རྩ་བའི་སེམས་ལ་མེད། བྱང་ཆུབ་ཀྱི་སེམས་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་ལ་མེད་ཅེས་བྱ་བ་ལ་སོགས་པ་སྟེ།
en: Having thus investigated and found that it does not exist in the intrinsic nature of the others, they also investigate and find that it does not exist in its own intrinsic nature: “the thought of the wholesome roots does not exist in the thought of the wholesome roots, the thought of awakening does not exist in the thought of awakening,” and so on.

source: དེ་བཞིན་ཉིད་ཙམ་དུ་མཐོང་བ་ལ་ནི་དེ་ལྟ་བུའི་ཀུན་ཏུ་དཔྱོད་པ་མེད་པའི་ཕྱིར་རོ།
en: This is because when it is seen as just suchness there is no such investigation. “

source: །ཀཽ་ཤི་ཀ་དགེ་བའི་རྩ་བའི་སེམས་གང་ཡིན་པ་དེ་ནི་སེམས་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་དེ་བཞིན་ཉིད་ཙམ་ཁོ་ནར་སྟོན་ཏོ།
en: Kauśika, the thought of the wholesome roots is no thought,” and so on, teaches that it is just mere suchness.

source: །སེམས་ནི་རང་གི་ཆོས་ཉིད་ཀྱི་དབང་གིས་སེམས་ཀུན་བརྟགས་པ་དང་བྲལ་བའི་ཕྱིར་སེམས་མེད་པའི་ངོ་བོ་ཉིད་དེ་ཆོས་ཉིད་ཀྱི་སེམས་སུ་གྲག་གོ།
en: From the perspective of its own true dharmic nature, thought is free from falsely imagined thought so the intrinsic nature that is the nonexistence of thought comes to be known as the true dharmic nature of thought. “

source: །སེམས་མེད་པ་ནི་སེམས་མེད་པ་དང་འགྲོགས་པར་མི་འགྱུར་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་ཆོས་ཉིད་ཀྱི་སེམས་སུ་གྲག་པ་ལས་འགྲོགས་པའམ་ཡོད་པའམ་ཡོངས་སུ་བསྔོ་བ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མ་གྲག་གོ་ཞེས་སྟོན་ཏོ།
en: A nonexistent thought does not touch a nonexistent thought,” and so on. This is teaching that other than what comes to be known as the true dharmic nature of thought, no touching or existing or dedication comes to be known in any way at all.

source: །དེའི་ཚེ་ནི་དེ་སོ་སོ་རང་གིས་རིག་པ་ཡིན་པས་བསམ་པའི་ལམ་ལས་འདས་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་མ་ཡིན་ནོ།
en: At that time it is a self-reflexive analytic knowledge beyond the path of the conceivable, hence it is “inconceivable” and is “no thought.” “

source: །ཀཽ་ཤི་ཀ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤེས་རབ་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Kauśika, this is the bodhisattva great beings’ perfection of wisdom” means it is nonconceptual wisdom that has gone to the other side.

source: །གང་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་སོ་སོར་རྟོག་པ་ཞེས་བྱ་བ་ནི་ཀུན་རྫོབ་ཏུའོ། །ཆོས་གང་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་ཅིང་མི་དམིགས་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་རོ།
en: Thus, conventionally they are “analytically investigating all phenomena,” but ultimately “not settling down on and not apprehending any phenomenon.”

source: །བདག་གིས་བྱས་པ་གཟོ་བར་བགྱི་སྟེ། བྱས་པ་མི་གཟོ་བར་མི་བགྱིའོ་ཞེས་བྱ་བས་ཅི་བསྟན་ཞེ་ན།
en: What does “I have to feel a sense of appreciation, Lord, and not feel no sense of appreciation” teach?

source: སྔོན་བདག་གི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པའི་ཚེ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་འཁོར་ན་ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱིས་གདམས་པ་དང་རྗེས་སུ་བསྟན་པས་ཡང་དག་པར་བསྟན་པ་དང་། ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་བརྙེས་ནས་ཡང་དག་པར་སྒྲུབ་པ་ལ་བཅུག་སྟེ།
en: It teaches that earlier when our Lord was in the form of a bodhisattva, the great śrāvakas in the retinue of earlier tathāgatas taught him with advice and instruction, inspiring him to take it up, and inspiring him to perfectly practice what he had found.

source: དེ་དག་གིས་བསྟན་པའི་རིམ་པས་བསྒྲུབས་ནས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Having gradually accomplished their teaching he became completely awakened.

source: །དེ་བས་ན་བདག་གིས་ཀྱང་འཁོར་འདིར་བྱང་ཆུབ་སེམས་དཔའ་འདི་རྣམས་ལ་གདམས་པ་དང་རྗེས་སུ་བསྟན་པས་ཡང་དག་པའི་སྒྲུབ་པ་ལ་དགོད་པར་བགྱིའོ།
en: Therefore, they too, by advising and instructing these bodhisattvas in this retinue, will establish them in perfect practice.

source: །སྔོན་གྱི་དེས་བདག་ཅག་གིས་བསྟན་པའི་རིམ་པས་བསྒྲུབས་ན་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: When they have gradually accomplished that earlier teaching, they will become completely awakened.

source: དེ་བས་ན་སྔོན་གྱི་ཉན་ཐོས་རྣམས་ཀྱིས་བྱས་པ་བདག་གིས་ཤེས་པར་བྱའོ་ཞེས་སྟོན་ཏོ།
en: Therefore, I should show appreciation to the earlier śrāvakas.

source: །གདམས་ཤིང་རྗེས་སུ་བསྟན་པ་ཞེས་བྱ་བ་ལ་སོགས་པའི་ཚིག་རྣམས་ལ་བྱེ་བྲག་ཅི་ཡོད་ཅེ་ན་འདི་ལ་ཐོག་མ་དང་བར་མ་དང་ཐ་མའི་གནས་སྐབས་གསུམ་སྟེ།
en: What is the difference between the words “advised and instructed” and so on? Here there are the three periods: starting, middle, and end.

source: །ཐོག་མར་ནི་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བྱའོ།
en: At the start they have to be “advised and instructed.”

source: །བར་དུ་ནི་སྒྲུབ་པའོ། །ཐ་མར་ནི་འབྲས་བུའོ།
en: In the middle there is practice, and at the end the result.

source: །དེ་ལ་ཐོག་མའི་གནས་སྐབས་སུ་འདི་དག་མ་བྱེད་ཅིག་ཅེས་བྱ་བ་མ་ཡིན་པ་ལས་བཟློག་པ་ནི་གདམས་པའོ།
en: There during the starting period “advice” is saying, “Do not do this,” preventing them from doing what they should not do. “

source: །འདི་དག་བྱོས་ཤིག་ཅེས་བྱ་བ་ལ་སྦྱོར་བ་ནི་རྗེས་སུ་བསྟན་པའོ།
en: Instruction” is saying, “Do this,” connecting them with the activities.

source: །བར་དུ་ནི་མི་སྒྲུབ་པ་དང་། ལོག་པར་སྒྲུབ་པ་དང་། ཅུང་ཟད་སྒྲུབ་པ་དང་། ཡང་དག་པར་སྒྲུབ་པ་སྟེ་གནས་སྐབས་བཞིའོ།
en: In the middle there are four periods: not practicing, practicing incorrectly, practicing a bit, and practicing perfectly.

source: །དེ་ལ་མི་ཤེས་པས་མི་སྒྲུབ་པ་ལ་སྒྲུབ་ཏུ་འཇུག་པ་ནི་ཡང་དག་པར་བསྟན་པའོ།
en: There, those who do not practice out of ignorance are inspired to practice when they are “taught.”

source: །ལོག་པར་ཤེས་པས་ལོག་པར་ཞུགས་པ་དག་ཡང་དག་པར་སྒྲུབ་ལ་སྦྱོར་བ་ནི་ཡང་དག་པར་འཛིན་དུ་བཅུག་པའོ།
en: Those who have set out incorrectly because of incorrect knowledge are connected with a perfect practice when they are “made to take them up.”

source: །ལེ་ལོ་ལ་སོགས་པའི་སྐྱོན་གྱིས་ཅུང་ཟད་སྒྲུབ་པ་དག་ལེགས་པར་བརྩོན་འགྲུས་རྩོམ་དུ་འཇུག་པ་ནི་ཡང་དག་པར་གཟེངས་སྟོད་པའོ།
en: Those who, because of the fault of laziness and so on, practice a bit, become inspired to try to persevere when they are “made… excited.”

source: །ཤེས་རབ་ཀྱིས་ཡང་དག་པར་ཞུགས་པ་དག་ལེགས་སོ་ཞེས་རྗེས་སུ་ཡི་རངས་ནས་དེ་ཉིད་ལ་སྦྱོར་བ་ནི་ཡང་དག་པར་རབ་ཏུ་དགྱེས་པར་བགྱིད་པའོ།
en: Having rejoiced, saying “excellent” to those who have set out perfectly with wisdom, they are connected with true reality when they are “motivated.”

source: །ཐ་མར་ནི་ལམ་ལ་བཅུག་ཅིང་འབྲས་བུ་ལ་གཞག་ཅེས་བྱ་བར་སྦྱར་བར་བྱའོ།
en: At the end, they are “caused… to enter into… and established” in the result.

source: །དེའི་འོག་ཏུ་ཇི་ལྟར་གནས་པར་བྱ་ཞེས་དྲིས་པ་ལ་གནས་པར་མི་བྱ་བ་ཡོངས་སུ་སྤངས་ཏེ་གནས་པར་བྱ་བས་གནས་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: Construe them like that. How should bodhisattva great beings stand in the perfection of wisdom? After that, in reference to the question, ‘How should they stand?’ it teaches that they should forsake where “they should not stand,” and, standing where they should stand, they “should stand in the perfection of wisdom.” “

source: །གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོང་པ་ཉིད་རྟོགས་པ་ནི་གནས་པའོ། །དམིགས་པའི་ཚུལ་ནི་གནས་པ་མ་ཡིན་ནོ་ཞེས་སྟོན་ཏེ།
en: Form is empty of form,” and so on, teaches that the realization of emptiness is where they stand. “By way of apprehending something” is where they should not stand.

source: དེས་ནི་འདི་སྐད་དུ་གང་གི་ཕྱིར་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་ཆོས་འདི་དག་གཟུགས་ལ་སོགས་པའི་ངོ་བོ་ཉིད་ཀྱིས་ཡོད་པ་མ་ཡིན་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ངོ་བོ་ཉིད་ཀྱིས་མེད་པ་སྟེ། དེ་དག་གི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཐ་མི་དད་དེ་གཅིག་གོ།
en: Therefore, this teaches that because these falsely imagined phenomena, form and so on, do not exist through the intrinsic nature of form and so on, bodhisattvas also do not exist through the intrinsic nature of a bodhisattva, and their emptinesses are not different, they are one.

source: །དེ་བས་ན་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་སོགས་པ་ནི་ཡོངས་སུ་གྲུབ་པ་ཡིན་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཉིས་སུ་མེད་པ་སྟེ། གཅིག་པའི་ཆོས་ཉིད་དུ་གནས་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའོ་ཞེས་བསྟན་ཏོ།
en: Therefore, form and so on in its true dharmic nature is a thoroughly established phenomenon, and a bodhisattva furthermore is “not two,” so to stand in their same true dharmic nature is to stand in the perfection of wisdom.

source: །གནས་པར་མི་བྱ་བའི་འགྲེས་ལ་ཡང་རྣམ་པ་གསུམ་དུ་བསྟན་ཏེ།
en: In the section of the text explaining where not to stand, furthermore, the teaching is in three parts.

source: ཆོས་ལ་གནས་པར་མི་བྱ་ཞེས་བྱ་བ་ནི་གཅིག་པའོ། །ཆོས་ཉིད་ལ་གནས་པར་མི་བྱ་ཞེས་བྱ་བ་ནི་གཉིས་པའོ། །གང་ཟག་རྣམས་ལ་གནས་པར་མི་བྱ་ཞེས་བྱ་བ་ནི་གསུམ་པའོ།
en: First they should not stand in the dharmas; second they should not stand in the true nature of dharmas; and third they should not stand as persons.

source: །དེ་ལ་ཆོས་ཀྱི་འགྲེས་ལ་ཡང་རྣམ་པ་གཉིས་སུ་བསྟན་ཏེ། ཆོས་བསྟན་པ་དང་། ཆོས་ཀྱི་མཚན་ཉིད་བསྟན་པའོ།
en: There, the section on the dharmas is again a teaching in two parts: teaching the dharmas and teaching the mark of the dharma.

source: །དེ་ལ་གཟུགས་ལ་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་ཉིད་ལ་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཆོས་བསྟན་པའོ།
en: From, “they should not stand in form by way of apprehending something,” up to “they should not stand in buddhahood by way of apprehending something,” is teaching the dharmas.
